In [1]:
#librerias
import pandas as pd
import os

In [14]:
#Usar os para las rutas y permitir compatibilidad con todos los SO 
#raw_data_path = os.path.join('..', 'data', 'SE2016.csv')
#raw_data_df = pd.read_csv(raw_data_path, header= 0)

In [16]:
print(raw_data_df.shape)
raw_data_df.head()

(42368865, 12)

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
0,1027003,45.83,5.11,196.0,20160101 00:00,NaN,NaN,NaN,98.0,278.75,279.05,NaN
1,1033002,46.09,5.81,350.0,20160101 00:00,0.0,0.0,0.0,99.0,278.25,278.35,NaN
2,1034004,45.77,5.69,330.0,20160101 00:00,0.0,0.0,0.0,100.0,279.15,279.15,NaN
3,1072001,46.20,5.29,260.0,20160101 00:00,NaN,NaN,0.0,NaN,NaN,276.55,NaN
4,1089001,45.98,5.33,252.0,20160101 00:00,0.0,0.0,0.0,95.0,278.85,279.55,102720.0

#### Escogamos una estaci√≥n aleatoria: En este caso la 1034004

In [19]:
station_data_df = raw_data_df[raw_data_df['number_sta'] == 1034004]
print(station_data_df.shape)
station_data_df.head()

(87698, 12)

,number_sta,lat,lon,height_sta,date,dd,ff,precip,hu,td,t,psl
2,1034004,45.77,5.69,330.0,20160101 00:00,0.0,0.0,0.0,100.0,279.15,279.15,NaN
485,1034004,45.77,5.69,330.0,20160101 00:06,0.0,0.0,0.0,100.0,279.05,279.05,NaN
968,1034004,45.77,5.69,330.0,20160101 00:12,0.0,0.0,0.0,100.0,278.85,278.85,NaN
1452,1034004,45.77,5.69,330.0,20160101 00:18,0.0,0.0,0.0,100.0,278.85,278.85,NaN
1936,1034004,45.77,5.69,330.0,20160101 00:24,0.0,0.0,0.0,100.0,278.85,278.85,NaN

## Crear un dataset con los datos filtrados

In [20]:
raw_dataset_save_path = os.path.join('..', 'data', 'single_station_data.csv')
station_data_df.to_csv(raw_dataset_save_path, index= False)